; domain
(define (domain grid)
(:requirements :strips :typing)
(:types place shape key)
(:predicates (conn ?x ?y - place)
             (key-shape ?k - key ?s - shape)
             (lock-shape ?x - place ?s - shape)
             (at ?r - key ?x - place )
       (at-robot ?x - place)
             (locked ?x - place)
             (carrying ?k - key)
             (open ?x - place)
)


(:action unlock
:parameters (?curpos ?lockpos - place ?key - key ?shape - shape)
:precondition (and (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (carrying ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos)))
)

(:action move
:parameters (?curpos ?nextpos - place)
:precondition (and (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos)))
)

(:action pickup
:parameters (?curpos - place ?key - key)
:precondition (and (at-robot ?curpos) (at ?key ?curpos))
:effect (and (carrying ?key)
   (not (at ?key ?curpos)))
))

; problem
(define (problem strips-grid-2)
(:domain  grid)
(:objects node_A node_B node_C node_D node_E
node_F node_G node_H node_I node_J
node_K - place
triangle square star circle - shape
key0 key1 key2 key3 - key)
(:init
(conn node_A node_C)
(conn node_C node_A)
(conn node_C node_B)
(conn node_C node_D)
(conn node_B node_C)
(conn node_D node_E)
(conn node_D node_G)
(conn node_D node_C)
(conn node_G node_D)
(conn node_G node_H)
(conn node_H node_G)
(conn node_H node_I)
(conn node_I node_H)
(conn node_E node_D)
(conn node_E node_F)
(conn node_F node_E)
(conn node_F node_J)
(conn node_J node_F)
(conn node_J node_K)
(conn node_K node_J)
(open node_A)
(locked node_B)
(lock-shape node_B square)
(open node_C)
(open node_D)
(open node_G)
(locked node_H)
(lock-shape node_H star)
(open node_I)
(locked node_E)
(lock-shape node_E triangle)
(open node_F)
(open node_J)
(locked node_K)
(lock-shape node_K circle)
(key-shape key0 triangle)
(at key0 node_C)
(key-shape key1 circle)
(at key1 node_I)
(key-shape key2 star)
(at key2 node_F)
(key-shape key3 square)
(at key3 node_K)
(at-robot node_A)
)
(:goal
(and
(at-robot node_I)
)
)
)

; plan
1. (move node_a node_c)
   deleted: (at-robot node_a)
   added: (at-robot node_c)
   goals met: 0 of 1
2. (pickup node_c key0)
   deleted: (at key0 node_c)
   added: (carrying key0)
   goals met: 0 of 1
3. (move node_c node_d)
   deleted: (at-robot node_c)
   added: (at-robot node_d)
   goals met: 0 of 1
4. (unlock node_d node_e key0 triangle)
   deleted: (locked node_e)
   added: (open node_e)
   goals met: 0 of 1
5. (move node_d node_e)
   deleted: (at-robot node_d)
   added: (at-robot node_e)
   goals met: 0 of 1
6. (move node_e node_f)
   deleted: (at-robot node_e)
   added: (at-robot node_f)
   goals met: 0 of 1
7. (pickup node_f key2)
   deleted: (at key2 node_f)
   added: (carrying key2)
   goals met: 0 of 1
8. (move node_f node_e)
   deleted: (at-robot node_f)
   added: (at-robot node_e)
   goals met: 0 of 1
9. (move node_e node_d)
   deleted: (at-robot node_e)
   added: (at-robot node_d)
   goals met: 0 of 1
10. (move node_d node_g)
   deleted: (at-robot node_d)
   added: (at-robot node_g)
   goals met: 0 of 1
11. (unlock node_g node_h key2 star)
   deleted: (locked node_h)
   added: (open node_h)
   goals met: 0 of 1
12. (move node_g node_h)
   deleted: (at-robot node_g)
   added: (at-robot node_h)
   goals met: 0 of 1
13. (move node_h node_i)
   deleted: (at-robot node_h)
   added: (at-robot node_i)
   goals met: 1 of 1
